In [2]:
from utils.linkage import deduplicate_perfect_matches, convert_duplicates_to_dict
from utils.constants import BASE_FILEPATH
import pandas as pd

In [6]:
inds_sample = pd.read_csv(BASE_FILEPATH / "output" / "complete_individuals_table.csv", index_col=0, low_memory=False).sample(10000)
orgs_sample = pd.read_csv(BASE_FILEPATH / "output" / "complete_organizations_table.csv", index_col=0).sample(10000)
inds_sample.head(5)

,id,first_name,last_name,full_name,entity_type,state,party,company
724734,c87d5ea3-0000-4cae-ab4c-febce5b17fc2,KIRSTIN,BRODERICK,KIRSTIN BRODERICK ...,Individual,NY,NaN,NaN
1187237,9af092ab-9e88-456f-9a27-5fa561d615eb,SARAH,LEVINE,SARAH LEVINE ...,Individual,NY,NaN,NaN
320448,89078c2f-964a-4044-a760-c0ea28e71c6e,DUSTIN,DEMLOW,DUSTIN DEMLOW ...,Individual,MI,NaN,NaN
238953,e9b9112d-7927-4cc1-b316-0beb55e9c47a,BRIAN,BARBAS,BRIAN BARBAS ...,Individual,IL,NaN,NaN
38632,a22c70ab-464c-4d89-a473-7c97931e0155,SUSAN MASSARO,MCFARLAND,SUSAN MASSARO MCFARLAND ...,Individual,MI,NaN,NaN

In [7]:
deduplicated_inds = deduplicate_perfect_matches(inds_sample)
deduplicated_orgs = deduplicate_perfect_matches(orgs_sample)

In [9]:
test = pd.read_csv(BASE_FILEPATH / "output" / "deduplicated_UUIDs.csv")
test.head(5)

                       duplicated_uuids                          mapped_uuids
0  28557e06-b13b-46e1-ab44-768bd8b4ff16  28557e06-b13b-46e1-ab44-768bd8b4ff16
1  66978565-4c37-432e-9c61-bb0ca1254850  66978565-4c37-432e-9c61-bb0ca1254850
2  51ca5ecb-6c20-4380-8562-36048ca72f46  51ca5ecb-6c20-4380-8562-36048ca72f46
3  735f45fd-4859-4285-a63c-29399250d20e  735f45fd-4859-4285-a63c-29399250d20e
4  5130157e-1c68-4529-9638-d5727e8feb07  5130157e-1c68-4529-9638-d5727e8feb07

In [11]:
dedup_inds_id = deduplicated_inds.id.tolist()
dedup_orgs_id = deduplicated_orgs.id.tolist()
test_ids = test.duplicated_uuids.tolist()

if all(x in test_ids for x in dedup_inds_id):
    print("Yes")
if all(x in test_ids for x in dedup_orgs_id):
    print("Yes")

Yes
Yes